Tutoriales/proyecto/app/controllers/courses_controller.rb

INSERT INTO "courses" ("title", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["title", "BassketBall"], ["created_at", "2023-11-20 02:03:39.563543"], ["updated_at", "2023-11-20 02:03:39.563543"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "updated_at" = ?, "description" = ? WHERE "courses"."id" = ?  [["updated_at", "2023-11-20 03:58:12.027686"], ["description", "Matematica en todas, muy bueno este curso"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)